<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of Audacity from brew-cask.
		</string>
	<key>Identifier</key>
	<string>com.github.allansan.allansan-autopkg-recipes.download.audacity</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>allansan-Audacity</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>cask_name</key>
				<string>audacity</string>
				<key>description</key>
				<string>audacity</string>
				<key>required</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>BrewCaskInfoProvider</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
